## Introduction to Pandas

In order to make a visualization, we need data and we usually need it in an organized tablular form suitable for plotting. The pandas library provides easy-to-use data structures and data analysis tools that you can use to make your data easier to plot. An important data structure of the pandas library is a fast and efficient object for data manipulation called a `DataFrame`. 

![](images/pandasDataFrame.png)

In [21]:
import pandas as pd

carLoans = {'Apple': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5},
             'OnePlus': {0: 'Toyota Sienna',1: 'Toyota Sienna',2: 'Toyota Sienna',3: 'Toyota Sienna',4: 'Toyota Sienna'}}

df = pd.DataFrame(data = carLoans)
df

   Apple        OnePlus
0      1  Toyota Sienna
1      2  Toyota Sienna
2      3  Toyota Sienna
3      4  Toyota Sienna
4      5  Toyota Sienna

In [23]:
import pandas as pd

models = {'Serial No' : {0:1,1:2,2:3}, 'Phone Models' : {0:'OnePlus', 1:'Apple',2:'Samsung'}}

pd.DataFrame(data = models)

   Serial No Phone Models
0          1      OnePlus
1          2        Apple
2          3      Samsung

In [25]:
models_list = {'Serial No' : [1,2,3], 'Phone' : ['Apple', 'Oneplus', 'Samsung']}

pd.DataFrame(models_list)

   Serial No    Phone
0          1    Apple
1          2  Oneplus
2          3  Samsung